"""empty"""

"""1. 打探"""
"""
lv0. 10%几率打探到当前城镇的基础售价和收购价, 0%几率打探到其他城镇的基础售价和收购价
lv1. 20%, 0%
lv2. 40%, 0%
lv3. 60%, 20%
lv4. 80%, 40%
lv5. 100%, 50%
"""
"""2. 学识(进行官方交易时收取的税率,普通交易该技能无效)"""
"""
lv0. 官方交易税率30%
lv1. 25%
lv2. 20%
lv3. 15%
lv4. 10%
lv5. 5%
"""
"""3. 魅力(计算好总价后进行折扣)"""
"""
lv0. 交易折扣0%
lv1. 1%
lv2. 2%
lv3. 3%
lv4. 4%
lv5. 5%
"""
"""4. 鉴定(算法: 先判断掺假几率,如果True再拿货物数量乘以掺假率)"""
"""
lv0. 特殊货物掺假几率20%, 掺假率20%
lv1. 18%, 20%
lv2. 16%, 20%
lv3. 12%, 20%
lv4. 8%, 20%
lv5. 3%, 20%
"""
"""5. 人脉(算法: 先判断概率,如果为True就随机找一个,否则就不找,说明当前没人愿意做交易)"""
"""
lv0. 0%概率在人脉圈中找到交易对象
lv1. 10%
lv2. 20%
lv3. 30%
lv4. 40%
lv5. 50%
"""
"""6. 辎重"""
"""
lv0. 每个物品负重减免0%
lv1. 2%
lv2. 4%
lv3. 6%
lv4. 8%
lv5. 10%
"""
"""7. 贷款"""
"""
lv0. 月利率20%
lv1. 18%
lv2. 16%
lv3. 12%
lv4. 10%
lv5. 8%
"""
